package com.main;

import java.util.Arrays;

public class Demo {
    public static void main(String[] args) {

//out("","","");


//        out("青岛", "王娜", "");
//        out("青岛", "李崇智", "");
//        out("青岛", "高俊宝", "李晶");
//        out("南宁", "陈华燕", "陈桂华,麦维捷,阳正锋,黄粲莹");
//        out("南宁", "王福民", "甘美娟,陈守龙,丘学山");
//        out("南宁", "李敏芳", "韦秀洁,文鑫,黄小珊,陆尚宁,汪旭红,磨丽冰");
//        out("厦门", "黄城端	", "邹慧华,王瑛,夏瑞月");
//        out("厦门", "谢桂源	", "刘士群,王明山,蔡元栋,邱文浩,毕玉娟");
//        out("广州", "任宪达	", "莫洪志,彭洁丽,吴伟浩");
//        out("广州", "董永杰	", "周媚媚,何恺华,黄泽彬,廖成成");
//        out("广州", "刘彩虹	", "刘晨东,张嘉炜,吴仕杰");
//        out("重庆", "吴丹	", "王宏波,陈建");
//        out("重庆", "陈龙	", "余幸波,刘涛,杨敏");
//        out("重庆", "苏旭铭	", "邓云龙");
//        out("苏州", "朱跟宝	", "陈家兰,刘美玲,曹文涛,吕晶晶,陈丽君");
//        out("苏州", "许建楠	", "李小梅,周灵孝,吕芸,王庭宇,高言隽");
//        out("上海", "卢玉亭	", "陶水峰,邓思思,徐宗启,王朝斐,吴江丽");
//        out("上海", "李思媚", "");
//        out("上海", "张杨芹	", "谈义霖,李义芹,耿佳丽,徐焕焕");
//        out("上海", "欧庆	", "窦晓蕾,周秀凯,李华");
//        out("上海", "袁吉世扬	", "黄晓炜,周依莎,刘煜,徐子渭,边缘,朱诚彬");
//        out("上海", "朱真好	", "胡加毛,李大羌,张欣,柯尤珍");
//        out("上海", "张婷婷	", "芮旭,张冉菁,黄俊杰,史金娣,李飞");
//        out("上海", "刘亚军	", "蒋佳炜,赵孟阳,谈家豪,叶敏");
//        out("上海", "盛慧	", "陈舟,陈龙,谢沛江,刘园园");
//        out("上海", "程芳芳	", "沈琦,刘权辉,张亚庆,林冬雪,柳小梅");
//        out("武汉", "周思捷	", "陈滕滕,叶惠萍,郝丽,罗旋,熊玉洲");
//        out("武汉", "陈寅	", "陈俊伟,潘峰,杨宗普,吴化荣");
//        out("武汉", "江海华	", "张伟,田琼,程亚利,钟彩姣");
//        out("武汉", "刘松	", "吴长响,戴红娟,陈智利,吴晶");
//        out("北京", "赵海青	", "冯静,杜洋,赵艳华,刘银萍,李满田,肖勇");
//        out("北京", "戢华康	", "徐莹,王新宇,邵娜娜,尹吉星");
//        out("北京", "杜江	", "李宁宁,池志远,李凤玲,尹吉星");
//        out("北京", "晏佐	", "孙世涛,张文博");
//        out("北京", "路正远	", "陈冠君,高卓,李莉");
//        out("南京", "龚应禄	", "周成育,曹德敏,陈华玉");
//        out("昆明", "孙毅冬	", "尹祥,苏盼,郭绍凯");
//        out("昆明", "耿雪梅	", "徐旭东,唐艺马,誉文");
//        out("昆明", "李波鲁	", "顾芮,冰吴,波刘通");
//        out("沈阳", "孟祥丽	", "许颖,沈继扬");
//        out("沈阳", "裴玉敏	", "翟晓宇,薛龙,冯禹,于玲");
//        out("沈阳", "刁世斌	", "傅祎妮,蔡丽丹,路秋萍,陈凤梅,丛睿");
//        out("深圳", "黄文娟	", "章巧妹,苏诗丽,肖锋志");
//        out("深圳", "蒲亚蓉	", "魏晓燕,郑金洲,杨华邦,黄骏");
//        out("深圳", "曾辉乐	", "黄嘉骏,吴丕壮,向晓玉");
//        out("深圳", "王重	", "邱智义,陈宇冰,何沛锦,黎一炀");
//        out("长沙", "吕岚	", "张智斌,刘俞喧,李君");
//        out("长沙", "邓敏	", "阳明成,凤翔,向兰");
//        out("杭州", "叶田	", "左传勤,任洁");
//        out("杭州", "方阳美	", "黄兰芳,方宗友,陈超,杨郑红");




         out("广州", "潘涛涛", "任宪达,莫洪志,彭洁丽,吴伟浩,董永杰,周媚媚,何恺华,黄泽彬,廖成成,刘彩虹,刘晨东,张嘉炜,吴仕杰");
         out("上海", "陶平锋", "卢玉亭,陶水峰,邓思思,徐宗启,王朝斐,吴江丽,胡曼莉,李思媚");
         out("上海", "李丽萍", "张杨芹,谈义霖,李义芹,耿佳丽,徐焕焕,欧庆,窦晓蕾,周秀凯,李华");
         out("上海", "戴盼盼", "袁吉世扬,黄晓炜,周依莎,刘煜,徐子渭,边缘,朱诚彬,汤娟,周昌凤");
         out("上海", "林来娣", "朱真好,胡加毛,李大羌,张欣,柯尤珍,张婷婷,芮旭,张冉菁,黄俊杰,史金娣,李飞,刘亚军,蒋佳炜,赵孟阳,谈家豪,叶敏");
         out("上海", "左传萍", "盛慧,陈舟,陈龙,谢沛江,刘园园,程芳芳,沈琦,刘权辉,张亚庆,林冬雪,柳小梅");
         out("北京", "贾伟贤", "杜江,李宁宁,池志远,李凤玲,党浩明");
         out("沈阳", "张晓勇", "裴玉敏,翟晓宇,薛龙,于玲,冯禹,刁世斌,路秋萍,傅祎妮,蔡丽丹,丛睿,陈凤梅,孟祥丽,许颖,沈继扬");
         out("深圳", "陈崇润", "曾辉乐,黄嘉骏,吴丕壮,向晓玉,王重,邱智义,陈宇冰,何沛锦,黎一炀,钟毓东");
         out("长沙", "李成", "邓敏,唐烨晰,彭晓韬,凤翔,阳明成,向兰,刘治国,吕岚,刘雨舟,龙思婷,张智斌,刘俞喧,李君");









    }

    public static void out(String city, String cname, String names) {
        city = city.trim();
        cname = cname.trim();
        names = names.trim();

        System.out.println(city + " " + city + cname + "总监小组 " + cname);
        if (names.equals("")) {
            return;
        }
        String finalCity = city;
        String finalCity1 = city;
        String finalCname = cname;
        Arrays.asList(names.split(",")).forEach(one -> {
            System.out.println(finalCity + " " + finalCity1 + finalCname + "总监小组 " + one);
        });
    }

}
