package com.main.text;

public class text {
    public static void main(String[] args) {

//        广州  潘涛涛 任宪达,莫洪志,彭洁丽,吴伟浩,董永杰,周媚媚,何恺华,黄泽彬,廖成成,刘彩虹,刘晨东,张嘉炜,吴仕杰
//        上海  陶平锋 卢玉亭,陶水峰,邓思思,徐宗启,王朝斐,吴江丽,胡曼莉,李思媚
//        上海  李丽萍 张杨芹,谈义霖,李义芹,耿佳丽,徐焕焕,欧庆,窦晓蕾,周秀凯,李华
//        上海  戴盼盼 袁吉世扬,黄晓炜,周依莎,刘煜,徐子渭,边缘,朱诚彬,汤娟,周昌凤
//        上海  林来娣 朱真好,胡加毛,李大羌,张欣,柯尤珍,张婷婷,芮旭,张冉菁,黄俊杰,史金娣,李飞,刘亚军,蒋佳炜,赵孟阳,谈家豪,叶敏
//        上海  左传萍 盛慧,陈舟,陈龙,谢沛江,刘园园,程芳芳,沈琦,刘权辉,张亚庆,林冬雪,柳小梅
//        北京  贾伟贤 杜江,李宁宁,池志远,李凤玲,党浩明
//        沈阳  张晓勇 裴玉敏,翟晓宇,薛龙,于玲,冯禹,刁世斌,路秋萍,傅祎妮,蔡丽丹,丛睿,陈凤梅,孟祥丽,许颖,沈继扬
//        深圳  陈崇润 曾辉乐,黄嘉骏,吴丕壮,向晓玉,王重,邱智义,陈宇冰,何沛锦,黎一炀,钟毓东
//        长沙  李成  邓敏,唐烨晰,彭晓韬,凤翔,阳明成,向兰,刘治国,吕岚,刘雨舟,龙思婷,张智斌,刘俞喧,李君

    }
}
